In [1]:
import tensorflow

/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:516: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint8 = np.dtype([("qint8", np.int8, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:517: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint8 = np.dtype([("quint8", np.uint8, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:518: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint16 = np.dtype([("qint16", np.int16, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:519: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint16 = np.dtype([("quint16", np.uint16, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:520: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint32 = np.dtype([("qint32", np.int32, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorflow/python/framework/dtypes.py:525: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  np_resource = np.dtype([("resource", np.ubyte, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:541: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint8 = np.dtype([("qint8", np.int8, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:542: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint8 = np.dtype([("quint8", np.uint8, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:543: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint16 = np.dtype([("qint16", np.int16, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:544: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_quint16 = np.dtype([("quint16", np.uint16, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:545: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  _np_qint32 = np.dtype([("qint32", np.int32, 1)])
/opt/anaconda3/envs/smedu/lib/python3.7/site-packages/tensorboard/compat/tensorflow_stub/dtypes.py:550: FutureWarning: Passing (type, 1) or '1type' as a synonym of type is deprecated; in a future version of numpy, it will be understood as (type, (1,)) / '(1,)type'.
  np_resource = np.dtype([("resource", np.ubyte, 1)])

In [2]:
print("hellow tensorflow~")

hellow tensorflow~

In [3]:
# pandas 사용하기
import numpy as np # numpy 도 함께 import
import pandas as pd

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.dtypes

dtype('int64')

In [7]:
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [8]:
obj3.name='Salary'
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [11]:
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [12]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [14]:
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [15]:
df.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [16]:
df['name']

0    Beomwoo
1    Beomwoo
2    Beomwoo
3        Kim
4       Park
Name: name, dtype: object

In [17]:
df.name

0    Beomwoo
1    Beomwoo
2    Beomwoo
3        Kim
4       Park
Name: name, dtype: object

In [18]:
df[['year','points']]

   year  points
0  2013     1.5
1  2014     1.7
2  2015     3.6
3  2016     2.4
4  2015     2.9

In [19]:
df['penalty']=0.5

In [20]:
df

      name  year  points  penalty
0  Beomwoo  2013     1.5      0.5
1  Beomwoo  2014     1.7      0.5
2  Beomwoo  2015     3.6      0.5
3      Kim  2016     2.4      0.5
4     Park  2015     2.9      0.5

In [21]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5]

In [22]:
df

      name  year  points  penalty
0  Beomwoo  2013     1.5      0.1
1  Beomwoo  2014     1.7      0.2
2  Beomwoo  2015     3.6      0.3
3      Kim  2016     2.4      0.4
4     Park  2015     2.9      0.5

In [23]:
np.arange(5)

array([0, 1, 2, 3, 4])

In [24]:
df['zeros'] = np.arange(5)

In [25]:
df

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2
3      Kim  2016     2.4      0.4      3
4     Park  2015     2.9      0.5      4

In [28]:
# Series를 추가할 수도 있다.
val = pd.Series([-1.2, -1.5, -1.7,1,1], index=['two','four','five','df','dff'])

In [29]:
val

two    -1.2
four   -1.5
five   -1.7
df      1.0
dff     1.0
dtype: float64

In [30]:
df['debt']=val

In [31]:
df

      name  year  points  penalty  zeros  debt
0  Beomwoo  2013     1.5      0.1      0   NaN
1  Beomwoo  2014     1.7      0.2      1   NaN
2  Beomwoo  2015     3.6      0.3      2   NaN
3      Kim  2016     2.4      0.4      3   NaN
4     Park  2015     2.9      0.5      4   NaN

In [32]:
df

      name  year  points  penalty  zeros  debt
0  Beomwoo  2013     1.5      0.1      0   NaN
1  Beomwoo  2014     1.7      0.2      1   NaN
2  Beomwoo  2015     3.6      0.3      2   NaN
3      Kim  2016     2.4      0.4      3   NaN
4     Park  2015     2.9      0.5      4   NaN

In [33]:
del df['debt']

In [34]:
df

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2
3      Kim  2016     2.4      0.4      3
4     Park  2015     2.9      0.5      4

In [35]:
df[0:3]

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2

In [36]:
df[0:]

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2
3      Kim  2016     2.4      0.4      3
4     Park  2015     2.9      0.5      4

In [37]:
df[:5]

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2
3      Kim  2016     2.4      0.4      3
4     Park  2015     2.9      0.5      4

In [38]:
df[:3]

      name  year  points  penalty  zeros
0  Beomwoo  2013     1.5      0.1      0
1  Beomwoo  2014     1.7      0.2      1
2  Beomwoo  2015     3.6      0.3      2